[
    {
      "name": "Organize My Life",
      "date": "Fall 2023 - Spring 2024",
      "body": "Over the course of the final year of my undergraduate program, I along with three other seniors worked with a client to create a file organization software for mobile. We used XP techniques to collaborate with the client and each other to produce a working prototype that satisfied the main desired features.",
      "image_src": "src/images/OMLDiagram-removebg-preview.png"
    },
    {
      "name": "AI Calendar Assistant",
      "date": "Spring 2024",
      "body": "As a final project for an independent study on generative AI, I used prompt engineering techniques to create an AI calendar assistant that was capable of scheduling and organizing events. Using React and Node.js I created a prototype website frontend and backend. Then I tested various prompt engineering techniques across various LLMs.",
      "image_src": "src/images/AICalendarAssistant.png"
    },
    {
      "name": "3D Reconstruction",
      "date": "Spring 2023",
      "body": "Using deep learning as well as traditional computer vision techniques I and two other seniors demonstrated how one could automate a 3D reconstruciton from a moving single camera video of a soccer game. For the project we gave an outline of the proposed pipeline as well as an example of its effictiveness on a short clip of a professional game.",
      "image_src": "src/images/Soccer.png"
    },
    {
        "name": "Haskell Video Game",
        "date": "Spring 2023",
        "body": "Created an arcade-style video game using Haskell. Gained expirence with a statically-typed and functional style language.",
        "image_src": "src/images/haskell.png"
    },
    {
        "name": "Cellular Automata",
        "date": "Winter 2022",
        "body": "With a partner I replicated multiple famous cellular automata simulations including Conway's Game of Life, Wolframs's Elementary Cellular Automaton, and Packard's Edge of Chaos. Through this project I learned about the concepts of complexity and emergent behavior.",
        "image_src": "src/images/cellular.png"
    },
    {
        "name": "Genetic Programming",
        "date": "Winter 2022",
        "body": "With a partner I programmed a tree-based genome capable of representing complex equations which were then used in optimization algorithms to select for equations that could model real-world phenomena.",
        "image_src": "src/images/GeneticProgramming.png"
    },
    {
        "name": "Scheme Interpreter",
        "date": "Fall 2022",
        "body": "Designed and built a Scheme intpreter that can parse and execute most Scheme expressions. I utilized sytax expansion to robustly respoind to Scheme's flexible syntax.",
        "image_src": "src/images/scheme.png"
    }
    ,
    {
        "name": "Digital Catan",
        "date": "Spring 2022",
        "body": "Recreated the board game Catan in Java along with a small group of students. Utilied test driven design (TDD) to as well as software design principles to create robust and flexible program that met all requirements.",
        "image_src": "src/images/Catan.png"
    }
    ,
    {
        "name": "Elden Ring Item Mangagement",
        "date": "Spring 2022",
        "body": "Created an online charecter item manager for the popular video game Elden Ring. Designed and implemented a relational database in SQL. Created website frontend using javascript and a python backend using Flask.",
        "image_src": "src/images/elden.png"
    }
    ,
    {
        "name": "Major Planner",
        "date": "Spring 2022",
        "body": "With a partner I created a website that facilitates filling out the complicated Rose-Hulman double major application. Created an intuitive and responsive UI that allows students to quickly and easily plan their coursework and convert the plan into an application.",
        "image_src": "src/images/doublemajor.png"
    }
    ,
    {
        "name": "Verilog Processor",
        "date": "Winter 2021",
        "body": "Designed and modeled a minimal instruction set general-purpose processor. Implementented the desgin as a multicycle datapath in Verilog. Created an assembler that translated assembly instructions into machine code. Wrote eulers algorithm in our assembly language and ran the algorithum on our datapath using an FPGA.",
        "image_src": "src/images/datapath.png"
    }
    ,
    {
        "name": "Editor AVL Trees Data Structure",
        "date": "Winter 2021",
        "body": "Created a data structure designed for a text editing software using self-balancing AVL trees. The tree structure was able to insert and delete at any position in worst-case log(N) time complexity.",
        "image_src": "src/images/AVLTree.png"
    }
    ,
    {
        "name": "Genetic Algorithm",
        "date": "Winter 2021",
        "body": "Designed and developed a simple genetic algorithm which included a graphical representation and user interface.",
        "image_src": "src/images/GeneticAlgorithm.png"
    },
    {
        "name": "Legend of Zelda Game",
        "date": "Fall 2020",
        "body": "Create a 2D adventure game in the style of the orginial Legend of Zelda",
        "image_src": "src/images/zelda1header.png"
    }
  ]
  